Masmiseim36/nxpSDK/boards/evkmimxrt595/aws_examples/ota_demo_wifi_wiced_4343W/pin_mux.c
    const uint32_t OSPI_RESET = (/* Pin is configured as PIO4_5 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Normal mode */
                                 IOPCTL_PIO_SLEW_RATE_NORMAL |
                                 /* Normal drive */
                                 IOPCTL_PIO_FULLDRIVE_DI |
                                 /* Analog mux is disabled */
                                 IOPCTL_PIO_ANAMUX_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI);
    /* PORT4 PIN5 (coords: P16) is configured as PIO4_5 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_OSPI_RESET_PORT, BOARD_INITPINS_OSPI_RESET_PIN, OSPI_RESET);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
